# T-YOLOv8 — Single-stream temporal detection model
# Paper: "Exploiting Temporal Context for Tiny Object Detection" (Corsel et al., WACVW 2023)
#
# Input:  X_app ∈ R^{H×W×3}  — 3-channel grayscale temporal stack
#         channels: [f_{t-s}, f_t, f_{t+s}]  (all grayscale → 1 channel each)
#
# Architecture: Standard YOLOv8 backbone+neck+head with ch=3.
# The temporal information is encoded in the 3-channel input; the rest of the
# model is unchanged from YOLOv8 (paper Section 3.1).
#
# Detection heads: P3/8, P4/16, P5/32  (3 scales — no P6, faithful to paper)

# VisDrone
nc: 10
scales:
  # [depth, width, max_channels]
  n: [0.33, 0.25, 1024]
  s: [0.33, 0.50, 1024]
  m: [0.67, 0.75, 768]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.25, 512]

# Backbone (identical to standard YOLOv8; ch=3 is passed at model construction)
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]           # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]          # 1-P2/4
  - [-1, 3, C2f, [128, True]]
  - [-1, 1, Conv, [256, 3, 2]]          # 3-P3/8
  - [-1, 6, C2f, [256, True]]
  - [-1, 1, Conv, [512, 3, 2]]          # 5-P4/16
  - [-1, 6, C2f, [512, True]]
  - [-1, 1, Conv, [1024, 3, 2]]         # 7-P5/32
  - [-1, 3, C2f, [1024, True]]
  - [-1, 1, SPPF, [1024, 5]]            # 9

# Head (standard YOLOv8 FPN neck + 3 detection heads)
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]]           # cat backbone P4
  - [-1, 3, C2f, [512]]                 # 12

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]]           # cat backbone P3
  - [-1, 3, C2f, [256]]                 # 15 (P3/8-small)

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 12], 1, Concat, [1]]          # cat head P4
  - [-1, 3, C2f, [512]]                 # 18 (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 9], 1, Concat, [1]]           # cat head P5
  - [-1, 3, C2f, [1024]]               # 21 (P5/32-large)

  - [[15, 18, 21], 1, Detect, [nc]]     # Detect(P3, P4, P5)
